Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/soc_vectors.h
// For the core 0
// --------------

// Cortex_M7 Processor Exceptions Numbers

#define NonMaskableInt_C0_IRQn          NonMaskableInt_IRQn
#define HardFault_C0_IRQn               HardFault_IRQn
#define MemoryManagement_C0_IRQn        MemoryManagement_IRQn
#define BusFault_C0_IRQn                BusFault_IRQn
#define UsageFault_C0_IRQn              UsageFault_IRQn
#define SVCall_C0_IRQn                  SVCall_IRQn
#define DebugMonitor_C0_IRQn            DebugMonitor_IRQn
#define PendSV_C0_IRQn                  PendSV_IRQn
#define SysTick_C0_IRQn                 SysTick_IRQn

// SOC Specific Interrupt Numbers

#define WWDG1_C0_IRQn                   WWDG1_IRQn
#define PVD_PVM_C0_IRQn                 PVD_PVM_IRQn
#define RTC_TAMP_STAMP_CSS_LSE_C0_IRQn  RTC_TAMP_STAMP_CSS_LSE_IRQn
#define RTC_WKUP_C0_IRQn                RTC_WKUP_IRQn
#define FLASH_C0_IRQn                   FLASH_IRQn
#define RCC_C0_IRQn                     RCC_IRQn
#define EXTI0_C0_IRQn                   EXTI0_IRQn
#define EXTI1_C0_IRQn                   EXTI1_IRQn
#define EXTI2_C0_IRQn                   EXTI2_IRQn
#define EXTI3_C0_IRQn                   EXTI3_IRQn
#define EXTI4_C0_IRQn                   EXTI4_IRQn
#define DMA1_STR0_C0_IRQn               DMA1_STR0_IRQn
#define DMA1_STR1_C0_IRQn               DMA1_STR1_IRQn
#define DMA1_STR2_C0_IRQn               DMA1_STR2_IRQn
#define DMA1_STR3_C0_IRQn               DMA1_STR3_IRQn
#define DMA1_STR4_C0_IRQn               DMA1_STR4_IRQn
#define DMA1_STR5_C0_IRQn               DMA1_STR5_IRQn
#define DMA1_STR6_C0_IRQn               DMA1_STR6_IRQn
#define ADC1_2_C0_IRQn                  ADC1_2_IRQn
#define FDCAN1_IT0_C0_IRQn              FDCAN1_IT0_IRQn
#define FDCAN2_IT0_C0_IRQn              FDCAN2_IT0_IRQn
#define FDCAN1_IT1_C0_IRQn              FDCAN1_IT1_IRQn
#define FDCAN2_IT1_C0_IRQn              FDCAN2_IT1_IRQn
#define EXTI9_5_C0_IRQn                 EXTI9_5_IRQn
#define TIM1_BRK_C0_IRQn                TIM1_BRK_IRQn
#define TIM1_UP_C0_IRQn                 TIM1_UP_IRQn
#define TIM1_TRG_COM_C0_IRQn            TIM1_TRG_COM_IRQn
#define TIM1_CC_C0_IRQn                 TIM1_CC_IRQn
#define TIM2_C0_IRQn                    TIM2_IRQn
#define TIM3_C0_IRQn                    TIM3_IRQn
#define TIM4_C0_IRQn                    TIM4_IRQn
#define I2C1_EV_C0_IRQn                 I2C1_EV_IRQn
#define I2C1_ER_C0_IRQn                 I2C1_ER_IRQn
#define I2C2_EV_C0_IRQn                 I2C2_EV_IRQn
#define I2C2_ER_C0_IRQn                 I2C2_ER_IRQn
#define SPI1_C0_IRQn                    SPI1_IRQn
#define SPI2_C0_IRQn                    SPI2_IRQn
#define USART1_C0_IRQn                  USART1_IRQn
#define USART2_C0_IRQn                  USART2_IRQn
#define USART3_C0_IRQn                  USART3_IRQn
#define EXTI15_10_C0_IRQn               EXTI15_10_IRQn
#define RTC_ALARM_C0_IRQn               RTC_ALARM_IRQn
#define TIM8_BRK_TIM12_C0_IRQn          TIM8_BRK_TIM12_IRQn
#define TIM8_UP_TIM13_C0_IRQn           TIM8_UP_TIM13_IRQn
#define TIM8_TRG_COM_TIM14_C0_IRQn      TIM8_TRG_COM_TIM14_IRQn
#define TIM8_CC_C0_IRQn                 TIM8_CC_IRQn
#define DMA1_STR7_C0_IRQn               DMA1_STR7_IRQn
#define FMC_C0_IRQn                     FMC_IRQn
#define SDMMC1_C0_IRQn                  SDMMC1_IRQn
#define TIM5_C0_IRQn                    TIM5_IRQn
#define SPI3_C0_IRQn                    SPI3_IRQn
#define UART4_C0_IRQn                   UART4_IRQn
#define UART5_C0_IRQn                   UART5_IRQn
#define TIM6_DAC_C0_IRQn                TIM6_DAC_IRQn
#define TIM7_C0_IRQn                    TIM7_IRQn
#define DMA2_STR0_C0_IRQn               DMA2_STR0_IRQn
#define DMA2_STR1_C0_IRQn               DMA2_STR1_IRQn
#define DMA2_STR2_C0_IRQn               DMA2_STR2_IRQn
#define DMA2_STR3_C0_IRQn               DMA2_STR3_IRQn
#define DMA2_STR4_C0_IRQn               DMA2_STR4_IRQn
#define ETH_C0_IRQn                     ETH_IRQn
#define ETH_WKUP_C0_IRQn                ETH_WKUP_IRQn
#define FDCAN_CAL_C0_IRQn               FDCAN_CAL_IRQn
#define DMA2_STR5_C0_IRQn               DMA2_STR5_IRQn
#define DMA2_STR6_C0_IRQn               DMA2_STR6_IRQn
#define DMA2_STR7_C0_IRQn               DMA2_STR7_IRQn
#define USART6_C0_IRQn                  USART6_IRQn
#define I2C3_EV_C0_IRQn                 I2C3_EV_IRQn
#define I2C3_ER_C0_IRQn                 I2C3_ER_IRQn
#define OTG_HS_EP1_OUT_C0_IRQn          OTG_HS_EP1_OUT_IRQn
#define OTG_HS_EP1_IN_C0_IRQn           OTG_HS_EP1_IN_IRQn
#define OTG_HS_WKUP_C0_IRQn             OTG_HS_WKUP_IRQn
#define OTG_HS_C0_IRQn                  OTG_HS_IRQn
#define DCMI_C0_IRQn                    DCMI_IRQn
#define HASH_RNG_C0_IRQn                HASH_RNG_IRQn
#define FPU_C0_IRQn                     FPU_IRQn
#define UART7_C0_IRQn                   UART7_IRQn
#define UART8_C0_IRQn                   UART8_IRQn
#define SPI4_C0_IRQn                    SPI4_IRQn
#define SPI5_C0_IRQn                    SPI5_IRQn
#define SPI6_C0_IRQn                    SPI6_IRQn
#define SAI1_C0_IRQn                    SAI1_IRQn
#define LTDC_C0_IRQn                    LTDC_IRQn
#define LTDC_ER_C0_IRQn                 LTDC_ER_IRQn
#define DMA2D_C0_IRQn                   DMA2D_IRQn
#define SAI2_C0_IRQn                    SAI2_IRQn
#define QUADSPI_C0_IRQn                 QUADSPI_IRQn
#define LPTIM1_C0_IRQn                  LPTIM1_IRQn
#define CEC_C0_IRQn                     CEC_IRQn
#define I2C4_EV_C0_IRQn                 I2C4_EV_IRQn
#define I2C4_ER_C0_IRQn                 I2C4_ER_IRQn
#define SPDIF_C0_IRQn                   SPDIF_IRQn
#define OTG_FS_EP1_OUT_C0_IRQn          OTG_FS_EP1_OUT_IRQn
#define OTG_FS_EP1_IN_C0_IRQn           OTG_FS_EP1_IN_IRQn
#define OTG_FS_WKUP_C0_IRQn             OTG_FS_WKUP_IRQn
#define OTG_FS_C0_IRQn                  OTG_FS_IRQn
#define DMAMUX1_OV_C0_IRQn              DMAMUX1_OV_IRQn
#define HRTIM1_MST_C0_IRQn              HRTIM1_MST_IRQn
#define HRTIM1_TIMA_C0_IRQn             HRTIM1_TIMA_IRQn
#define HRTIM1_TIMB_C0_IRQn             HRTIM1_TIMB_IRQn
#define HRTIM1_TIMC_C0_IRQn             HRTIM1_TIMC_IRQn
#define HRTIM1_TIMD_C0_IRQn             HRTIM1_TIMD_IRQn
#define HRTIM1_TIME_C0_IRQn             HRTIM1_TIME_IRQn
#define HRTIM1_FLT_C0_IRQn              HRTIM1_FLT_IRQn
#define DFSDM1_FLT0_C0_IRQn             DFSDM1_FLT0_IRQn
#define DFSDM1_FLT1_C0_IRQn             DFSDM1_FLT1_IRQn
#define DFSDM1_FLT2_C0_IRQn             DFSDM1_FLT2_IRQn
#define DFSDM1_FLT3_C0_IRQn             DFSDM1_FLT3_IRQn
#define SAI3_C0_IRQn                    SAI3_IRQn
#define SWPMI1_C0_IRQn                  SWPMI1_IRQn
#define TIM15_C0_IRQn                   TIM15_IRQn
#define TIM16_C0_IRQn                   TIM16_IRQn
#define TIM17_C0_IRQn                   TIM17_IRQn
#define MDIOS_WKUP_C0_IRQn              MDIOS_WKUP_IRQn
#define MDIOS_C0_IRQn                   MDIOS_IRQn
#define JPEG_C0_IRQn                    JPEG_IRQn
#define MDMA_C0_IRQn                    MDMA_IRQn
#define SDMMC_C0_IRQn                   SDMMC_IRQn
#define HSEM0_C0_IRQn                   HSEM0_IRQn
#define ADC3_C0_IRQn                    ADC3_IRQn
#define DMAMUX2_OVR_C0_IRQn             DMAMUX2_OVR_IRQn
#define BDMA_CH0_C0_IRQn                BDMA_CH0_IRQn
#define BDMA_CH1_C0_IRQn                BDMA_CH1_IRQn
#define BDMA_CH2_C0_IRQn                BDMA_CH2_IRQn
#define BDMA_CH3_C0_IRQn                BDMA_CH3_IRQn
#define BDMA_CH4_C0_IRQn                BDMA_CH4_IRQn
#define BDMA_CH5_C0_IRQn                BDMA_CH5_IRQn
#define BDMA_CH6_C0_IRQn                BDMA_CH6_IRQn
#define BDMA_CH7_C0_IRQn                BDMA_CH7_IRQn
#define COMP_C0_IRQn                    COMP_IRQn
#define LPTIM2_C0_IRQn                  LPTIM2_IRQn
#define LPTIM3_C0_IRQn                  LPTIM3_IRQn
#define LPTIM4_C0_IRQn                  LPTIM4_IRQn
#define LPTIM5_C0_IRQn                  LPTIM5_IRQn
#define LPUART_C0_IRQn                  LPUART_IRQn
#define WWDG1_RST_C0_IRQn               WWDG1_RST_IRQn
#define CRS_C0_IRQn                     CRS_IRQn
#define SAI4_C0_IRQn                    SAI4_IRQn
#define WKUP_C0_IRQn                    WKUP_IRQn

// Prototypes

#ifdef __cplusplus
extern  "C" {
#endif

