Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/soc_vectors.h
// For the core 0
// --------------

// Exceptions

void    NonMaskableInt_C0_IRQHandler(void);
void    HardFault_C0_IRQHandler(void);
void    MemoryManagement_C0_IRQHandler(void);
void    BusFault_C0_IRQHandler(void);
void    UsageFault_C0_IRQHandler(void);
void    SVCall_C0_IRQHandler(void);
void    DebugMonitor_C0_IRQHandler(void);
void    PendSV_C0_IRQHandler(void);
void    SysTick_C0_IRQHandler(void);

// IRQHandler

void    WWDG1_C0_IRQHandler(void);
void    PVD_PVM_C0_IRQHandler(void);
void    RTC_TAMP_STAMP_CSS_LSE_C0_IRQHandler(void);
void    RTC_WKUP_C0_IRQHandler(void);
void    FLASH_C0_IRQHandler(void);
void    RCC_C0_IRQHandler(void);
void    EXTI0_C0_IRQHandler(void);
void    EXTI1_C0_IRQHandler(void);
void    EXTI2_C0_IRQHandler(void);
void    EXTI3_C0_IRQHandler(void);
void    EXTI4_C0_IRQHandler(void);
void    DMA1_STR0_C0_IRQHandler(void);
void    DMA1_STR1_C0_IRQHandler(void);
void    DMA1_STR2_C0_IRQHandler(void);
void    DMA1_STR3_C0_IRQHandler(void);
void    DMA1_STR4_C0_IRQHandler(void);
void    DMA1_STR5_C0_IRQHandler(void);
void    DMA1_STR6_C0_IRQHandler(void);
void    ADC1_2_C0_IRQHandler(void);
void    FDCAN1_IT0_C0_IRQHandler(void);
void    FDCAN2_IT0_C0_IRQHandler(void);
void    FDCAN1_IT1_C0_IRQHandler(void);
void    FDCAN2_IT1_C0_IRQHandler(void);
void    EXTI9_5_C0_IRQHandler(void);
void    TIM1_BRK_C0_IRQHandler(void);
void    TIM1_UP_C0_IRQHandler(void);
void    TIM1_TRG_COM_C0_IRQHandler(void);
void    TIM1_CC_C0_IRQHandler(void);
void    TIM2_C0_IRQHandler(void);
void    TIM3_C0_IRQHandler(void);
void    TIM4_C0_IRQHandler(void);
void    I2C1_EV_C0_IRQHandler(void);
void    I2C1_ER_C0_IRQHandler(void);
void    I2C2_EV_C0_IRQHandler(void);
void    I2C2_ER_C0_IRQHandler(void);
void    SPI1_C0_IRQHandler(void);
void    SPI2_C0_IRQHandler(void);
void    USART1_C0_IRQHandler(void);
void    USART2_C0_IRQHandler(void);
void    USART3_C0_IRQHandler(void);
void    EXTI15_10_C0_IRQHandler(void);
void    RTC_ALARM_C0_IRQHandler(void);
void    TIM8_BRK_TIM12_C0_IRQHandler(void);
void    TIM8_UP_TIM13_C0_IRQHandler(void);
void    TIM8_TRG_COM_TIM14_C0_IRQHandler(void);
void    TIM8_CC_C0_IRQHandler(void);
void    DMA1_STR7_C0_IRQHandler(void);
void    FMC_C0_IRQHandler(void);
void    SDMMC1_C0_IRQHandler(void);
void    TIM5_C0_IRQHandler(void);
void    SPI3_C0_IRQHandler(void);
void    UART4_C0_IRQHandler(void);
void    UART5_C0_IRQHandler(void);
void    TIM6_DAC_C0_IRQHandler(void);
void    TIM7_C0_IRQHandler(void);
void    DMA2_STR0_C0_IRQHandler(void);
void    DMA2_STR1_C0_IRQHandler(void);
void    DMA2_STR2_C0_IRQHandler(void);
void    DMA2_STR3_C0_IRQHandler(void);
void    DMA2_STR4_C0_IRQHandler(void);
void    ETH_C0_IRQHandler(void);
void    ETH_WKUP_C0_IRQHandler(void);
void    FDCAN_CAL_C0_IRQHandler(void);
void    DMA2_STR5_C0_IRQHandler(void);
void    DMA2_STR6_C0_IRQHandler(void);
void    DMA2_STR7_C0_IRQHandler(void);
void    USART6_C0_IRQHandler(void);
void    I2C3_EV_C0_IRQHandler(void);
void    I2C3_ER_C0_IRQHandler(void);
void    OTG_HS_EP1_OUT_C0_IRQHandler(void);
void    OTG_HS_EP1_IN_C0_IRQHandler(void);
void    OTG_HS_WKUP_C0_IRQHandler(void);
void    OTG_HS_C0_IRQHandler(void);
void    DCMI_C0_IRQHandler(void);
void    HASH_RNG_C0_IRQHandler(void);
void    FPU_C0_IRQHandler(void);
void    UART7_C0_IRQHandler(void);
void    UART8_C0_IRQHandler(void);
void    SPI4_C0_IRQHandler(void);
void    SPI5_C0_IRQHandler(void);
void    SPI6_C0_IRQHandler(void);
void    SAI1_C0_IRQHandler(void);
void    LTDC_C0_IRQHandler(void);
void    LTDC_ER_C0_IRQHandler(void);
void    DMA2D_C0_IRQHandler(void);
void    SAI2_C0_IRQHandler(void);
void    QUADSPI_C0_IRQHandler(void);
void    LPTIM1_C0_IRQHandler(void);
void    CEC_C0_IRQHandler(void);
void    I2C4_EV_C0_IRQHandler(void);
void    I2C4_ER_C0_IRQHandler(void);
void    SPDIF_C0_IRQHandler(void);
void    OTG_FS_EP1_OUT_C0_IRQHandler(void);
void    OTG_FS_EP1_IN_C0_IRQHandler(void);
void    OTG_FS_WKUP_C0_IRQHandler(void);
void    OTG_FS_C0_IRQHandler(void);
void    DMAMUX1_OV_C0_IRQHandler(void);
void    HRTIM1_MST_C0_IRQHandler(void);
void    HRTIM1_TIMA_C0_IRQHandler(void);
void    HRTIM1_TIMB_C0_IRQHandler(void);
void    HRTIM1_TIMC_C0_IRQHandler(void);
void    HRTIM1_TIMD_C0_IRQHandler(void);
void    HRTIM1_TIME_C0_IRQHandler(void);
void    HRTIM1_FLT_C0_IRQHandler(void);
void    DFSDM1_FLT0_C0_IRQHandler(void);
void    DFSDM1_FLT1_C0_IRQHandler(void);
void    DFSDM1_FLT2_C0_IRQHandler(void);
void    DFSDM1_FLT3_C0_IRQHandler(void);
void    SAI3_C0_IRQHandler(void);
void    SWPMI1_C0_IRQHandler(void);
void    TIM15_C0_IRQHandler(void);
void    TIM16_C0_IRQHandler(void);
void    TIM17_C0_IRQHandler(void);
void    MDIOS_WKUP_C0_IRQHandler(void);
void    MDIOS_C0_IRQHandler(void);
void    JPEG_C0_IRQHandler(void);
void    MDMA_C0_IRQHandler(void);
void    SDMMC_C0_IRQHandler(void);
void    HSEM0_C0_IRQHandler(void);
void    ADC3_C0_IRQHandler(void);
void    DMAMUX2_OVR_C0_IRQHandler(void);
void    BDMA_CH0_C0_IRQHandler(void);
void    BDMA_CH1_C0_IRQHandler(void);
void    BDMA_CH2_C0_IRQHandler(void);
void    BDMA_CH3_C0_IRQHandler(void);
void    BDMA_CH4_C0_IRQHandler(void);
void    BDMA_CH5_C0_IRQHandler(void);
void    BDMA_CH6_C0_IRQHandler(void);
void    BDMA_CH7_C0_IRQHandler(void);
void    COMP_C0_IRQHandler(void);
void    LPTIM2_C0_IRQHandler(void);
void    LPTIM3_C0_IRQHandler(void);
void    LPTIM4_C0_IRQHandler(void);
void    LPTIM5_C0_IRQHandler(void);
void    LPUART_C0_IRQHandler(void);
void    WWDG1_RST_C0_IRQHandler(void);
void    CRS_C0_IRQHandler(void);
void    SAI4_C0_IRQHandler(void);
void    WKUP_C0_IRQHandler(void);

#ifdef __cplusplus
}
#endif
